<img src="images/usm.jpg" width="480" height="240" align="left"/>

# MAT281 - Laboratorio N°03

## Objetivos de la clase

* Reforzar los conceptos básicos de pandas.

## Contenidos

* [Problema 01](#p1)

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información tal como: edad ,sexo, profesión, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [1]:
import pandas as pd
import os

In [2]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|").set_index('user_id')
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. ¿Cuál es el número de observaciones en el conjunto de datos?

In [3]:
#Número de filas por número de columnas
df.shape[0]*df.shape[1]

3772

2. ¿Cuál es el número de columnas en el conjunto de datos?

In [4]:
#número de columnas
df.shape[1]

4

3. Imprime el nombre de todas las columnas

In [5]:
for i in df.columns:
    print(i)

age
gender
occupation
zip_code

4. Imprima el índice del dataframe

In [6]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

5. ¿Cuál es el tipo de datos de cada columna?

In [7]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

6. Resumir el conjunto de datos

In [8]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

7. Resume conjunto de datos  con todas las columnas

In [9]:
df.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

8. Imprimir solo la columna de **occupation**.

In [10]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

9. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [11]:
ocupaciones=df['occupation'].unique()
for i in ocupaciones:
    print (i)
print('\ncantidad de ocupaciones')
print(len(ocupaciones))

technician
other
writer
executive
administrator
student
lawyer
educator
scientist
entertainment
programmer
librarian
homemaker
artist
engineer
marketing
none
healthcare
retired
salesman
doctor

cantidad de ocupaciones
21

10. ¿Cuál es la ocupación más frecuente?

In [20]:
resume=df.describe(include='all')
print('la ocupación mas frecuente es:')
print(resume['occupation'].top)

la ocupación mas frecuente es:
student

11. ¿Cuál es la edad media de los usuarios?

In [13]:
#Forma 1
print('la media de edad es:')
print(resume['age'][4])

la media de edad es:
34.05196182396607

In [14]:
#forma 2
cont=0
for i in df['age']:
    cont+=i
tot=df.shape[0]
print(cont/tot)

34.05196182396607

12. ¿Cuál es la edad con menos ocurrencia?

In [15]:
cont=df['age'].value_counts()
print('las edades menos ocurrentes son:')
for i in range(0,len(cont)):
    if cont.values[i]==cont.values.min():
        print(cont.index[i])

las edades menos ocurrentes son:
11
10
73
66
7